In [257]:
import pandas as pd

In [259]:
data = {
    'Name': ['John Doe', 'Jane Smith', 'Sam Johnson', 'Anna Brown', None, 'Paul Davis', 'Mary Johnson', 'John Doe', 'Tom Lee', 'Emily Davis'],
    'Age': [28, None, 45, 30, 32, 41, 28, 28, 35, 23],
    'Gender': ['Male', 'Female', 'Male', 'Female', None, 'Male', 'Female', 'Male', 'Male', 'Female'],
    'Email': ['johndoe@example.com', 'janesmith@example', 'sam.johnson@example.com', 'annabrown@example.com', 'sarah.connor@example.com', 'pauldavis@sample.com', 'mary.johnson@sample', 'johndoe@example.com', 'tom.lee@sample.com', 'emily.davis@sample.com'],
    'Salary': [50000, 60000, None, 70000, 80000, 90000, 55000, 50000, 120000, 35000],
    'Join_Date': ['2021-03-15', '2021-07-01', '2020-01-22', '2021-13-01', '2020-05-30', '2021-02-29', '2019-12-11', '2021-03-15', '2018-07-04', '2022-11-31']
}

df = pd.DataFrame(data)
df

           Name   Age  Gender                     Email    Salary   Join_Date
0      John Doe  28.0    Male       johndoe@example.com   50000.0  2021-03-15
1    Jane Smith   NaN  Female         janesmith@example   60000.0  2021-07-01
2   Sam Johnson  45.0    Male   sam.johnson@example.com       NaN  2020-01-22
3    Anna Brown  30.0  Female     annabrown@example.com   70000.0  2021-13-01
4          None  32.0    None  sarah.connor@example.com   80000.0  2020-05-30
5    Paul Davis  41.0    Male      pauldavis@sample.com   90000.0  2021-02-29
6  Mary Johnson  28.0  Female       mary.johnson@sample   55000.0  2019-12-11
7      John Doe  28.0    Male       johndoe@example.com   50000.0  2021-03-15
8       Tom Lee  35.0    Male        tom.lee@sample.com  120000.0  2018-07-04
9   Emily Davis  23.0  Female    emily.davis@sample.com   35000.0  2022-11-31

In [ ]:
# Displaying a concise summary of the DataFrame
df.info()

In [ ]:
# Displaying basic statistics for numerical columns
df.describe()

In [ ]:
# Displaying the shape of the DataFrame (rows, columns)
df.shape

In [ ]:
# Checking for duplicate values 
df.duplicated().sum()

In [ ]:
# Deleting duplicate values
df = df.drop_duplicates()
df

In [ ]:
# Checking for unique values
df.nunique()

In [ ]:
# Displaying the datatypes of each column 
df.dtypes

In [ ]:
# Checking for the number of the missing values in each column 
df.isnull().sum()

In [ ]:
# Filling the missing 'Age' column 
df['Age'].mean()
df['Age'] = df['Age'].fillna(round(df['Age'].mean()-2))

In [279]:
# Droping rows where the 'Name' column is missing  
df = df.dropna(subset='Name')

In [ ]:
# Filling the missing 'Salary' column
df['Salary'].median()
df['Salary'] = df['Salary'].fillna((df['Age']/2)*1000+df['Salary'].median())

In [ ]:
# Changing 'Join_Date' data type to DateTime  
df['Join_Date'] = pd.to_datetime(df['Join_Date'],errors='coerce')
df.dropna(subset=['Join_Date'], inplace=True)

In [ ]:
# Seting 'Name' column as index
df = df.set_index('Name')
df

In [289]:
# Correcting 'Email' column
df['Email']=df['Email'].apply(lambda x:x+'.com' if 'com' not in x else x)
df

               Age  Gender                    Email    Salary  Join_Date
Name
John Doe      28.0    Male      johndoe@example.com   50000.0 2021-03-15
Jane Smith    31.0  Female    janesmith@example.com   60000.0 2021-07-01
Sam Johnson   45.0    Male  sam.johnson@example.com   82500.0 2020-01-22
Mary Johnson  28.0  Female  mary.johnson@sample.com   55000.0 2019-12-11
Tom Lee       35.0    Male       tom.lee@sample.com  120000.0 2018-07-04